#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.data.aws_region.current: Reading...
aws_ecr_repository.rocket_league_internal: Refreshing state... [id=rocket-league-internal]
aws_ecr_repository.rocket_league_web: Refreshing state... [id=rocket-league-web]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0275ec836be642cac]
module.vpc.data.aws_region.current: Read complete after 0s [id=us-west-2]
aws_s3_bucket.tf_state: Refreshing state... [id=selectquote-test-tf-state]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-001148c7f2684b738]
module.vpc.aws_subnet.private_subnet: Refreshing state... [id=subnet-0d2c0a4d18c0ee58b]
module.vpc.aws_route_table.public_route_table: Refreshing state... [id=rtb-035fa4e1d088f1aee]
module.vpc.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-0f9055a8567beefc1]
module.vpc.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0f56312067741d56e]
module.alb.aws_security_group.alb_web: Refreshing state... [id=sg-0a519eaf79c47177f]
module.alb.aws_lb_target_group.tg_web: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:146663730447:targetgroup/tg-web/f6fd4537c38703b1]
aws_s3_bucket_ownership_controls.tf_state: Refreshing state... [id=selectquote-test-tf-state]
aws_s3_bucket_versioning.tf_state: Refreshing state... [id=selectquote-test-tf-state]
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-09597d3f4db295cb0]
aws_s3_bucket_acl.tf_state: Refreshing state... [id=selectquote-test-tf-state,private]
module.vpc.aws_route.public_internet_route: Refreshing state... [id=r-rtb-035fa4e1d088f1aee1080289494]
module.alb.aws_vpc_security_group_ingress_rule.alb_http: Refreshing state... [id=sgr-039b886803b0ce5ec]
module.vpc.aws_route_table_association.public_subnet_association[0]: Refreshing state... [id=rtbassoc-06889b209977dc497]
module.vpc.aws_route_table_association.public_subnet_association[1]: Refreshing state... [id=rtbassoc-09e47b34a3ee96e57]
module.vpc.aws_security_group.endpoints: Refreshing state... [id=sg-020736feec6fd6b05]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-0f601b9f5f14d0ef4]
module.vpc.aws_route_table.private_route_table: Refreshing state... [id=rtb-0887900ebdd3baf99]
module.vpc.aws_route_table_association.private_subnet_association: Refreshing state... [id=rtbassoc-0029cd95e742e68d1]
module.vpc.aws_vpc_endpoint.endpoints["cloudwatch"]: Refreshing state... [id=vpce-09a5c7ba513dfcd72]
module.vpc.aws_vpc_endpoint.endpoints["s3"]: Refreshing state... [id=vpce-0f841f5f30edcb9d5]
module.vpc.aws_vpc_endpoint.endpoints["ssm"]: Refreshing state... [id=vpce-04db56a99af840241]
module.vpc.aws_vpc_endpoint.endpoints["ecr-api"]: Refreshing state... [id=vpce-0f853714f9ef3b1ea]
module.vpc.aws_vpc_endpoint.endpoints["ec2messages"]: Refreshing state... [id=vpce-0385758ce745850c4]
module.vpc.aws_vpc_endpoint.endpoints["ssmmessages"]: Refreshing state... [id=vpce-05c2792904ab9d80b]
module.vpc.aws_vpc_endpoint.endpoints["ecr-dkr"]: Refreshing state... [id=vpce-0881215a1b786e0c0]
module.internal.tls_private_key.main: Refreshing state... [id=1f3b88a8c804d4f71c66e728631288325ae518cb]
module.internal.data.aws_caller_identity.current: Reading...
module.web.aws_cloudwatch_log_group.web_container: Refreshing state... [id=/ecs/web-container]
module.internal.aws_iam_role.internal: Refreshing state... [id=internal-ec2]
module.web.aws_iam_role.ecs_task_execution: Refreshing state... [id=ecs-task-execution]
module.internal.data.aws_ami.flatcar: Reading...
module.internal.aws_security_group.internal: Refreshing state... [id=sg-07e18f8deff0ea14a]
module.internal.data.aws_region.current: Reading...
module.web.aws_ecs_cluster.web: Refreshing state... [id=arn:aws:ecs:us-west-2:146663730447:cluster/web-cluster]
module.internal.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.web.aws_security_group.web: Refreshing state... [id=sg-086a6af547fbb278b]
module.internal.aws_key_pair.ssh: Refreshing state... [id=main-ssh]
local_file.ssh_private_key_pem: Refreshing state... [id=ddcfb8ba3d2a3b8c7edbed2f6f3c8cb889c788b0]
module.internal.data.aws_caller_identity.current: Read complete after 0s [id=146663730447]
module.internal.data.template_file.internal: Reading...
module.internal.aws_route53_zone.internal: Refreshing state... [id=Z098106636KN43PA9TWBS]
module.internal.data.template_file.internal: Read complete after 0s [id=deb06d2d578ee2cd4220ee09f2a32e84e563a679c113c3f23c9549b5258d7046]
module.internal.data.ct_config.internal: Reading...
module.internal.data.ct_config.internal: Read complete after 0s [id=1808560130]
module.internal.aws_vpc_security_group_egress_rule.https: Refreshing state... [id=sgr-061ab55ed5de262c8]
module.internal.aws_vpc_security_group_ingress_rule.ssh: Refreshing state... [id=sgr-06f5cd8aaab0395bb]
module.web.aws_vpc_security_group_ingress_rule.ssh: Refreshing state... [id=sgr-0c0c9b2bedadfdff3]
module.web.aws_security_group_rule.alb_ingress: Refreshing state... [id=sgrule-1646746537]
module.web.aws_vpc_security_group_ingress_rule.web_http: Refreshing state... [id=sgr-07d1166ef01f2bcef]
module.web.aws_security_group_rule.internal_egress: Refreshing state... [id=sgrule-1456257139]
module.web.aws_vpc_security_group_egress_rule.https_egress: Refreshing state... [id=sgr-059cdf987bbe79acf]
module.web.aws_iam_role_policy_attachment.ecs_task_execution: Refreshing state... [id=ecs-task-execution/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.alb.aws_security_group_rule.web_egress: Refreshing state... [id=sgrule-2492925692]
module.internal.aws_security_group_rule.web_ingress: Refreshing state... [id=sgrule-451178770]
module.internal.aws_iam_role_policy_attachment.ssm: Refreshing state... [id=internal-ec2/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.internal.aws_iam_role_policy_attachment.ecr_read: Refreshing state... [id=internal-ec2/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.internal.aws_iam_instance_profile.internal: Refreshing state... [id=internal-profile]
module.internal.data.aws_ami.flatcar: Read complete after 1s [id=ami-0678dedf4891728e9]
module.internal.aws_instance.internal[0]: Refreshing state... [id=i-076051172c5634c2c]
module.internal.aws_route53_record.internal: Refreshing state... [id=Z098106636KN43PA9TWBS_instances.146663730447.com_A]
module.web.aws_ecs_task_definition.web: Refreshing state... [id=web-task]
module.web.aws_ecs_service.web: Refreshing state... [id=arn:aws:ecs:us-west-2:146663730447:service/web-cluster/web-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # local_file.ssh_private_key_pem will be created
  + resource "local_file" "ssh_private_key_pem" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "ssh-private-key.pem"
      + id                   = (known after apply)
    }

  # module.alb.aws_lb.alb_web will be created
  + resource "aws_lb" "alb_web" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "alb-web"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "us-west-2"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = [
          + "sg-0a519eaf79c47177f",
        ]
      + subnets                                                      = [
          + "subnet-0f56312067741d56e",
          + "subnet-0f9055a8567beefc1",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.http_listener will be created
  + resource "aws_lb_listener" "http_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "us-west-2"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:146663730447:targetgroup/tg-web/f6fd4537c38703b1"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.web.aws_ecs_service.web will be updated in-place
  ~ resource "aws_ecs_service" "web" {
        id                                 = "arn:aws:ecs:us-west-2:146663730447:service/web-cluster/web-service"
        name                               = "web-service"
        tags                               = {}
        # (20 unchanged attributes hidden)

      + load_balancer {
          + container_name   = "web-container"
          + container_port   = 8500
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:146663730447:targetgroup/tg-web/f6fd4537c38703b1"
            # (1 unchanged attribute hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tony-ebel, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*